# ============ Taps ============
tap "homebrew/bundle"

tap "antoniorodr/memo"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mobile-dev-inc/tap"
tap "steipete/tap"
tap "supabase/tap"
brew "glib"
brew "harfbuzz"
brew "openjdk"
brew "apktool"
brew "atuin"
brew "bat"
brew "bazelisk"
brew "btop"
brew "cocoapods"
brew "direnv"
brew "duf"
brew "dust"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fastlane"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "python@3.12"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "glab"
brew "gnupg"
brew "librsvg"
brew "graphviz"
brew "httpie"
brew "ios-deploy"
brew "ios-webkit-debug-proxy"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lcdf-typetools"
brew "mise"
brew "mvfst"
brew "neovim"
brew "ninja"
brew "node"
brew "openjdk@11"
brew "pinentry-mac"
brew "pipx"
brew "ripgrep"
brew "ruby@3.3"
brew "starship"
brew "stow"
brew "swiftformat"
brew "tldr"
brew "transcrypt"
brew "watchman"
brew "yarn"
brew "youtubedr"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "mobile-dev-inc/tap/maestro"
brew "supabase/tap/supabase"

# ============ Apps ============
cask "ghostty"
cask "zed"
cask "fork"
cask "spotify"
cask "temurin"
cask "zulu@17"


vscode "aaron-bond.better-comments"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bwya77.islands-dark"
vscode "christopherstyles.html-entities"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql-syntax"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "redhat.vscode-yaml"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "swmansion.react-native-ide"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "webpro.vscode-knip"
vscode "yoavbls.pretty-ts-errors"
